In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../data/예제/University_date.csv", encoding="CP949")

In [3]:
df

      대학이름         창립일
0    서울대학교  1946-10-15
1    KAIST  1971-02-16
2    UNIST  2007-09-03
3  포항공과대학교  1986-12-03
4    고려대학교  1905-05-05
5     GIST  1993-11-17
6    건국대학교  1946-05-15
7    울산대학교  1969-12-24
8    부산대학교  1946-05-15

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   대학이름    9 non-null      object
 1   창립일     9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes

In [5]:
pd.to_datetime(df["창립일"])

0   1946-10-15
1   1971-02-16
2   2007-09-03
3   1986-12-03
4   1905-05-05
5   1993-11-17
6   1946-05-15
7   1969-12-24
8   1946-05-15
Name: 창립일, dtype: datetime64[ns]

In [9]:
df

      대학이름         창립일
0    서울대학교  1946-10-15
1    KAIST  1971-02-16
2    UNIST  2007-09-03
3  포항공과대학교  1986-12-03
4    고려대학교  1905-05-05
5     GIST  1993-11-17
6    건국대학교  1946-05-15
7    울산대학교  1969-12-24
8    부산대학교  1946-05-15

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   대학이름    9 non-null      object
 1   창립일     9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes

In [10]:
pd.to_datetime(df["창립일"], format="%Y-%m-%d")

0   1946-10-15
1   1971-02-16
2   2007-09-03
3   1986-12-03
4   1905-05-05
5   1993-11-17
6   1946-05-15
7   1969-12-24
8   1946-05-15
Name: 창립일, dtype: datetime64[ns]

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   대학이름    9 non-null      object
 1   창립일     9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes

In [13]:
df["창립일"] = pd.to_datetime(df["창립일"])

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   대학이름    9 non-null      object
 1   창립일     9 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 276.0+ bytes

In [15]:
pd.date_range("2000-01-01", "2000-01-10")

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10'],
              dtype='datetime64[ns]', freq='D')

In [16]:
pd.date_range("2000-01-01", periods=3)

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03'], dtype='datetime64[ns]', freq='D')

In [24]:
pd.date_range("2000-01-01 10:30:00", periods=5, freq="s")

DatetimeIndex(['2000-01-01 10:30:00', '2000-01-01 10:30:01',
               '2000-01-01 10:30:02', '2000-01-01 10:30:03',
               '2000-01-01 10:30:04'],
              dtype='datetime64[ns]', freq='s')

In [25]:
df = pd.read_csv("../data/예제/University_date.csv", encoding="CP949")
df["창립일"] = pd.to_datetime(df["창립일"])

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   대학이름    9 non-null      object
 1   창립일     9 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 276.0+ bytes

In [28]:
df["창립일"].dt.date

0    1946-10-15
1    1971-02-16
2    2007-09-03
3    1986-12-03
4    1905-05-05
5    1993-11-17
6    1946-05-15
7    1969-12-24
8    1946-05-15
Name: 창립일, dtype: object

In [29]:
df["창립일"].dt.year

0    1946
1    1971
2    2007
3    1986
4    1905
5    1993
6    1946
7    1969
8    1946
Name: 창립일, dtype: int32

In [30]:
df["창립일"].dt.month

0    10
1     2
2     9
3    12
4     5
5    11
6     5
7    12
8     5
Name: 창립일, dtype: int32

In [34]:
df["월(영문)"] = df["창립일"].dt.month_name()

In [35]:
df

      대학이름        창립일          1      월(영문)
0    서울대학교 1946-10-15    October    October
1    KAIST 1971-02-16   February   February
2    UNIST 2007-09-03  September  September
3  포항공과대학교 1986-12-03   December   December
4    고려대학교 1905-05-05        May        May
5     GIST 1993-11-17   November   November
6    건국대학교 1946-05-15        May        May
7    울산대학교 1969-12-24   December   December
8    부산대학교 1946-05-15        May        May

In [36]:
df["창립일"].dt.day

0    15
1    16
2     3
3     3
4     5
5    17
6    15
7    24
8    15
Name: 창립일, dtype: int32

In [37]:
df["창립일"].dt.weekday

0    1
1    1
2    0
3    2
4    4
5    2
6    2
7    2
8    2
Name: 창립일, dtype: int32

In [38]:
df["창립일"].dt.day_name()

0      Tuesday
1      Tuesday
2       Monday
3    Wednesday
4       Friday
5    Wednesday
6    Wednesday
7    Wednesday
8    Wednesday
Name: 창립일, dtype: object

In [39]:
df["창립일"].dt.quarter

0    4
1    1
2    3
3    4
4    2
5    4
6    2
7    4
8    2
Name: 창립일, dtype: int32

In [40]:
df["창립일"].dt.dayofyear

0    288
1     47
2    246
3    337
4    125
5    321
6    135
7    358
8    135
Name: 창립일, dtype: int32